#+title: Add Optional Swap For NixOS
#+Tags[]: nixos linux
#+Date: 2023-04-09
#+Draft: false
#+PROPERTY: header-args :eval never-export

SSDs are primarily valued for their speed, although inexpensive SSDs may
exhibit reliability issues while maintaining acceptable performance.

While using NixOS, if some hardware is not available at boot, you cannot
simply boot into rescue mode and perform a quick edit on =/etc/fstab=; there
are more advanced recovery processes that need to take place. This article explores the implementation of an inexpensive NVMe M.2 device
for swap storage while maintaining system bootability in case of hardware
failure.

This document examines the implementation of such a device as swap storage,
analyzing performance implications and overall results.

* Partitioning

The following disk will be split into two partitions in a 60/40 ratio:
#+begin_src bash :results output verbatim
lsblk /dev/nvme1n1
#+end_src

#+RESULTS:
: NAME        MAJ:MIN RM   SIZE RO TYPE MOUNTPOINTS
: nvme1n1     259:3    0 476.9G  0 disk
: ├─nvme1n1p1 259:4    0 286.2G  0 part
: └─nvme1n1p2 259:5    0 190.8G  0 part

Use the new device:
#+begin_src bash :eval never-export
export DEVICE="/dev/nvme1n1"
parted "${DEVICE}" -- mklabel gpt
parted "${DEVICE}" -- mkpart swap 0% 60%
parted "${DEVICE}" -- mkpart swap 60% 100%
#+end_src

* Swap
Creating the =swap= partition using =mkswap=, first determine the actual
disk:

#+begin_src bash :results output verbatim :eval never-export
sudo mkswap -L swap-nvme /dev/mapper/swap
#+end_src

#+RESULTS:
: Setting up swapspace version 1, size = 286.1 GiB (307248492544 bytes)
: LABEL=swap-nvme, UUID=ac965b4f-f857-4cd3-8c87-91e0ca3a2271

A lazy way to get the proper configuration for the new swap partition is to
activate it and run =nixos-generate-config --root /tmp=. It will generate the
NixOS configuration in =/tmp/etc/nixos/= and you can retrieve the hardware
configuration directly from the directory.

#+begin_src bash :results output verbatim :eval never-export
sudo swapon /dev/mapper/swap
sudo nixos-generate-config --root /tmp
#+end_src

Another approach is to adapt the code below to your needs. Note that *the
block device backing the swap should be referred to by the partition UUID*.
Optionally, it can be referred to using partition labels.

#+begin_src nix
  swapDevices = [{
    device = "/dev/disk/by-uuid/ac965b4f-f857-4cd3-8c87-91e0ca3a2271";
    options = [ "defaults" "nofail" ];
    discardPolicy = "once";
    encrypted = {
      label = "swap";
      blkDev = "/dev/disk/by-partuuid/faeffa11-a44f-47df-9520-4bdeb479a4e2";
      enable = true;
      keyFile = "/mnt-root/root/.swap.key";
    };
  }];
#+end_src

After enabling this configuration, the system will have available swap memory:

#+begin_src bash :results output verbatim :eval never-export
swapon --show
#+end_src

#+RESULTS:
: NAME      TYPE        SIZE USED PRIO
: /dev/dm-2 partition 286.1G   1G   -2

*** Setting NixOS Configuration for ZSwap with =lz4fast=
NixOS has already built-in support for [[https://github.com/NixOS/nixpkgs/blob/e8a861f940da69ca8d4607b893354b7177f7250e/pkgs/os-specific/linux/kernel/common-config.nix#L682][zswap]]; it just needs to be enabled.
First, as a good practice for configuration management, it is required to
confirm that the configuration is not set, and then after the change is
applied, to confirm that it is up and running. Whether =ZSwap= is enabled at boot time
depends on whether the =CONFIG_ZSWAP_DEFAULT_ON= =Kconfig= option is enabled.
This setting can then be overridden by providing the kernel command line
=zswap.enabled= option, for example =zswap.enabled=0.= ZSwap can also be enabled and
disabled at runtime using the =sysfs= interface.


#+begin_src bash
cat /proc/cmdline
#+end_src

#+RESULTS:
: initrd=\efi\nixos\dnap9dk2mgx1gdjgd61bdircvd08pbn7-initrd-linux-6.1-initrd.efi init=/nix/store/dgyxblfcrdgy6f1xiwfzvyaipzsh78vg-nixos-system-markarth-23.05.20230305.dirty/init loglevel=4

#+begin_src bash
sudo cat /sys/module/zswap/parameters/enabled
#+end_src

#+RESULTS:
: N

**** Enabling using =sysfs=
An alternative is to enable it by using the =sysfs= interface. This is useful
in cases where you want to test it, but prefer not to change the configuration
just yet.

#+begin_src bash
sudo echo 1 > /sys/module/zswap/parameters/enabled
#+end_src

Then the following can be used to assert that it is running:
#+begin_src bash
sudo grep -r . /sys/kernel/debug/zswap
#+end_src

#+RESULTS:
| /sys/kernel/debug/zswap/same_filled_pages:0     |
| /sys/kernel/debug/zswap/stored_pages:0          |
| /sys/kernel/debug/zswap/pool_total_size:0       |
| /sys/kernel/debug/zswap/duplicate_entry:0       |
| /sys/kernel/debug/zswap/written_back_pages:0    |
| /sys/kernel/debug/zswap/reject_compress_poor:0  |
| /sys/kernel/debug/zswap/reject_kmemcache_fail:0 |
| /sys/kernel/debug/zswap/reject_alloc_fail:0     |
| /sys/kernel/debug/zswap/reject_reclaim_fail:0   |
| /sys/kernel/debug/zswap/pool_limit_hit:0        |


**** Validate the changes
Then after a reboot confirm the configuration changes

#+begin_src bash
cat /proc/cmdline
#+end_src

#+RESULTS:
: initrd=\efi\nixos\pax13psm300w02m0cfcd9rhif6v75694-initrd-linux-6.1-initrd.efi init=/nix/store/18785fqmc3vv9dm67gpzld64zni5vrxn-nixos-system-markarth-23.05.20230305.dirty/init zswap.enabled=1 zswap.compressor=lz4 loglevel=4

#+begin_src bash
sudo cat /sys/module/zswap/parameters/enabled
#+end_src

#+RESULTS:
: Y

Validate the compression algorithm:

#+begin_src bash
sudo cat /sys/module/zswap/parameters/compressor
#+end_src

#+RESULTS:
: lz4

** ZSwap Compression Results
To determine how much gain was obtained in terms of space, we can determine the
difference between the expected consumption and the actual consumption in terms
of storage.

Each page is stored in memory aligned in blocks, usually with a size of 4k,
but determined by the variable =PAGESIZE=. =ZSwap= information can be obtained from the
=/sys/kernel/debug/zswap= directory. The main calculation is the amount of stored
pages, multiplied by their in-memory page size, divided by the sum of all
storage in use by ZSwap. The script below facilitates the process of determining
the actual gains:


#+begin_src bash :results verbatim drawer
P=$(sudo cat /sys/kernel/debug/zswap/stored_pages)
S=$(sudo cat /sys/kernel/debug/zswap/pool_total_size)
PZ=$(getconf PAGESIZE)
SWZ=$(free -m | grep Swap | awk '{print $2}')
RATIO=$(( P*PZ * 100 / S ))
TOTAL=$(( SWZ * RATIO / 100 ))
echo "ZSwap compression gain of ${RATIO}%, actual swap of ${SWZ}mb can hold an estimated ${TOTAL}mb."
#+end_src

#+RESULTS:
:results:
ZSwap compression gain of 237%, actual swap of 293014mb can hold an estimated 694443mb.
:end:

It should be noted that the presented numbers are based on estimations derived
from a statistical approach. It is important to acknowledge that the actual
results may differ slightly from those presented. Furthermore, it is worth
mentioning that the workload used in this test was focused on training a
convolutional neural network, with a relatively lower level of entropy compared
to other tasks, such as video encoding.

The impact of using a single thread for test execution has been considered.
Future work could investigate the performance of the benchmark in a
multi-threaded environment and compare it with the performance of executing
Python code in consideration of the =GIL= (Global Interpreter Lock).

Overall, the results demonstrate significant improvements. With =lz4= and =z3fold=
enabled, low entropy data achieves 381.58 mb/s compared to traditional swap's
150.17 mb/s, representing a 154% improvement. High entropy scenarios maintain
similar performance to traditional swap (151.28 mb/s vs 149.36 mb/s). The
storage capabilities were expanded by 237% on average during testing, while
achieving approximately 79% of RAM performance for low entropy data and
maintaining equivalent performance for high entropy workloads.

